Repository: atero18/c3t
Catalog: po/R-*.po
Languages: fr

source: Some errors happened during AHR calculations:
fr: Des erreurs sont apparues lors du calcul des RAH :

source: All experiences sent an error
fr: Toutes les itérations ont renvoyé une erreur

source: {sum(tailleDFs)} non-trivial regionalisation{?s} obtained
fr: {sum(tailleDFs)} partition{?s} non triviale{?s} obtenue{?s}

source: {sum(sapply(results, nrow))} feasable partitions obtained
fr: {sum(sapply(results, nrow))} partition{?s} faisable{?s} obtenue{?s}

source: No feasible solution obtained
fr: Aucune solution faisable obtenue

source: No linkage has been given
fr: Aucune distance de liaison fournie

source: Starting time: {t0}
fr: Heure de début : {t0}

source: Execution time: {Sys.time() - t0}
fr: Temps d exécution : {Sys.time() - t0}

source: the problem has ben divided in {length(listeSPb)} connected components
fr: Le problème a été divisé en {length(listeSPb)} composantes connexes

source: {nrow(data$grid)} AHC to evaluate
fr: {nrow(data$grid)} CAH à évaluer

source: Imporssible to generate non-trivial regionalisations
fr: Impossible de générer des régionalisations non-triviales

source: {length(lignesASupprimmer)} redundancie{?s} {?has/have} been removed.
fr: {length(lignesASupprimmer)} redondance{?s} {?a/ont} été supprimée{?s}

source: Calculation of the {criterion} criterion
fr: Calcul du critère {criterion}

source: With centroid linkage inter-elements distance `d` and context `data` must be given
fr: Avec la distance de liaison barycentre la fonction distance `d` et le contexte `data` doivent être fournis

source: With centroid linkage all variables must be quantitative
fr: Avec la distance de liaison barycentre toutes les variables de `data` doivent être quantitatives

source: The name vector must be of size `dim`
fr: Le vecteur de noms doit être de longueur `dim`

source: Complete matrix is expected but user ask for different number of rows and columns
fr: Une matrice complète est attendue mais l'utilisateur demande un nombre différent de lignes et de colonnes

source: `data` does not contain any value
fr: `data` ne contient aucune donnée

source: unrecognized type for `data`
fr: Type non reconnu pour `data`

source: x must be a matrix or graph contiguity
fr: `x` doit être une matrice ou un graphe de contiguïté

source: The number of elements is different between the partition and the contiguity matrix
fr: Le nombre d'éléments est différent entre la partition et la matrice de contiguïté

source: 0 cannot be a cluster ID
fr: 0 ne peut être un identifiant de cluster

source: `x` is not of the correct type
fr: Type non reconnu pour `x`

source: At least one datum indicates a rank greater than the number of individuals indicated via `dim`
fr: Au moins une donnée indique un rang plus grand que le nombre d'éléments "

source: `M` is not in the correct format
fr: Type non reconnue pour `M`

source: This criterion already exists
fr: Le critère existe déjà

source: All partitions must have the same number of elements
fr: Toutes les partitions doivent avoir le même nombre d'éléments

source: unrecognized optimality type for the criterion
fr: Type d'optimalité non reconnu pour le critère

source: At least the distance matrix or the distance function must be provided
fr: Au moins la matrice de distance ou la fonction distance doit être fournie

source: Data must be provided and must be a dataframe when 'd' is a distance function
fr: `data` doit être fourni et être un data frame lorsque `d` est fourni

source: The number of data points must be the same for `distances` and `data`
fr: Le nombre de données doit être le même pour `distances` et `data`

source: Unrecognized storage type
fr: Mode de stockage de données non reconnu

source: The provided distance function `d` is incorrect
fr: La distance `d` fournie est incorrecte

source: `data` must have rows and columns
fr: `data` doit avoir lignes et colonnes

source: Both vectors must have the same size
fr: Les deux vecteurs doivent avoir la même longueur

source: The distance calculation returns a negative value
fr: La fonction distance a retourné une valeur négative

source: Given solution is not a feasible solution
fr: La solution donnée n'est pas une solution faisable

source: interruption in the improvement
fr: Interruption de l'amélioration

source: `regionalisation` is not a feasible solution
fr: `regionalisation` n'est pas une solution faisable

source: Evaluation of the {nrow(grille)} enhancement{?s}
fr: Évaluation de {nrow(grille)} amélioration{?s}

source: Calculation of {length(evaluationCriteria)} evaluation criteria on the initial partition
fr: Calcul de {length(evaluationCriteria)} critère{?s} d'évaluation sur la partition initiale

source: Calcul of {length(evaluationCriteria)} evaluation criteria on the {nrow(results)} enhanced partition{?s}
fr: Calcul de {length(evaluationCriteria)} critère{?s} d'évaluation sur les {nrow(results)} partitions améliorées

source: `cluster1` and `cluster2` must be elements of `partition`
fr: `cluster1` et `cluster2` doivent être des éléments de `partition`

source: It is requested to order the contiguity list by distance, but distances are not indicated
fr: Il est demandé d'ordonner la liste de contiguïté par distance mais celles-ci ne sont pas indiquées

source: Unrecognized `search` mode
fr: Mode de parcours non reconnu pour `search`

source: Maximum size constraint is not verified
fr: La contrainte de taille maximale n'est pas vérifiée

source: No possible fusion
fr: Pas de fusion possible

source: Some fusion constraint have not been recognized
fr: Au moins une contrainte de fusion n'a pas été reconnue

source: Some fusion constraint mode have not been recognized
fr: Au moins un mode de contrainte de fusion n'a pas été reconnu

source: Impossible to complete the requested number of fusions
fr: Impossible de réaliser le nombre souhaité de fusions

source: Unknown `mode`. Must be unitary or random
fr: `mode` inconnu. Doit valoir unitary ou random

source: distance function gave a non positive value
fr: La fonction de distance a renvoyé une valeur non positive

source: both data.frames must have the same variables
fr: Les deux data frames doivent avoir les mêmes variables

source: the distance function provided a result that is not a positive number
fr: La fonction de distance a renvoyé une valeur non positive

source: Actually this function doesn't work for other type of data
fr: Actually cette fonction ne fonctionne pas pour d'autres types de données

source: `cluster1` and `cluster2` must be different
fr: `cluster1` et `cluster2` doivent être différents

source: The values used for Lance-Williams update gave at least one negative linkage distance
fr: Les coefficients utilisés pour la mise à jour de Lance-Williams ont engendré au moins une valeur négative

source: `cluster1` and `cluster2` must have elements
fr: `cluster1` et `cluster2` doivent avoir des éléments

source: `linkage` must be single, complete or average
fr: `linkage` doit valoir single, complete ou average

source: at least one of `partitionBefore` and `nbElementsClustersBefore` must be specified
fr: Au moins une des deux variables suivantes doivent être spécifiées : `partitionBefore`, `nbElementsClustersBefore`

source: the distance matrix is empty
fr: La matrice de distance est vide

source: Clusters already created and in use
fr: Cluster déjà créé et en utilisation

source: Existing clusters. Clearing their data
fr: Cluster déjà créé. Réinitialisation des données

source: Existing clusters. Complete reset
fr: Cluster déjà créé. Réinitialisation complète

source: The number of cores proposed ({nbCores}) is greater than the number of machine cores ({detectCores()}). Reducing
fr: Le nombre de coeurs proposés ({nbCores}) est plus grand que le nombre de coeurs disponibles ({detectCores()}). Réduction

source: The requested number of cores is 1. Unnecessary
fr: Le nombre de coeurs demandé est 1. Inutile

source: Creating {nbCores} clusters
fr: Création de {nbCores} coeurs

source: Clusters are present but in use. Set `forceStop` to `TRUE` to force stopping
fr: Les coeurs sont présents mais en cours d'utilisation. Fixer `forceStop` à `TRUE` pour forcer l'arrêt

source: Clusters are present but in use. Forceful deletion
fr: Les coeurs sont présents mais en cours d'utilisation. Arrêt forcé

source: Parallel computation using {c3t_nbCores()} clusters
fr: Calcul parallèle avec {c3t_nbCores()} coeurs

source: Parallelization did not work. Attempting sequential computation
fr: La parallélisation n'a pas fonctionnée. Tentative de calcul en séquentiel

source: Each partition should have a number of elements corresponding to the connected components
fr: Chaque partition doit avoir un nombre d'éléments correspondant à la taille des composantes connexes

source: no neighbors are given
fr: Aucun voisin n'est fourni

source: `subsetPoints` make references to `distances` row names but at least one of them doesn't exist.
fr: `subsetPoints` fait référence au nom des lignes de `distances` mais au moins l'une d'entre elles n'existe pas

source: `subsetNeighbors` make references to `distances` column names but at least one of them doesn't exist.
fr: `subsetNeighbors` fait référence au nom des colonnes de `distances` mais au moins l'une d'entre elles n'existe pas

source: Elements of `subsetNeighbors` are supposed to be unique
fr: `subsetNeighbors` est sensé être composé d'éléments uniques

source: Looking for inner neighbors needs a square distance matrix
fr: Chercher des voisins internes nécessite une matrice de distance carrée symétrique

source: Transfert or fusion must be allowed
fr: Au moins le transfert ou la fusion doit être autorisé

source: `regionalisation` doesn't check connectivity constraint
fr: `regionalisation` ne vérifie pas la contrainte de connectivité

source: Clusters fusion
fr: Fusion des clusters

source: Number of iterations (fusions) : {itFusions}
fr: Nombre d'itérations (fusions) : {itFusions}

source: Transfert of elements one-by-one
fr: Transfert des éléments un à un

source: Number of iterations (transferts) : {itTransfers}
fr: Nombre d'itérations (transferts) : {itTransfers}

source: unresolvable partition
fr: Partition non-résolvable

source: partially resolved partition
fr: Partition partiellement résolue

source: fully resolved partition
fr: Partition totalement résolue

source: `qualitatives_list` must be a list (or NULL)
fr: `qualitatives_list` doit être une liste ou NULL

source: `qualitatives_list` is empty
fr: `qualitatives_list` est vide

source: At least one element in `qualitatives_list` has size zero
fr: Au moins un élément de `qualitatives_list` est de taille nulle

source: At least one element in `qualitatives_list` is not a vector or factor
fr: Au moins un élément de `qualitatives_list` n'est pas un vecteur

source: No context has been generated
fr: Aucun contexte n'a été généré

source: avgPersonsPerCell_int must be strictly positive
fr: avgPersonsPerCell_int doit être strictement positif

source: grid not found
fr: grille non trouvée

source: `distance` is incorrect
fr: `distance` incorrect

source: There are not enough available zones to consider all parameters
fr: Le nombre de zones disponible est insuffisant pour satisfaire toutes les contraintes

source: `ppt_in_metropolises_real` must be a proportion in [0,1]
fr: `ppt_in_metropolises_real` doit être une proportion dans [0,1]

source: `i` must have exactly two columns
fr: `i` doit avoit exactement deux colonnes

source: Default value is already defined for the diagonal
fr: Une valeur par défaut est déjà définie pour la diagonale

source: Specified indexes are incorrect
fr: Les indices spécifiés sont incorrects

source: Matrix must be symmetric
fr: La matrice doit être symmétrique

source: Matrices must have the same size
fr: Les matrices doivent avoir la même taille

source: Defaut value for the diagonal isn't respected
fr: La valeur par défaut pour la diagonale n'est pas respectée

source: Given indexes are incorrect
fr: Les indices indiqués sont incorrects

source: For the diagonal a default value has been given
fr: Pour la diagonale une valeur par défaut a été donnée

source: Element is not contained in values because is part of the diagonal
fr: L'élément n'est pas contenu dans less valeurs car fait partie de la diagonale

source: `i` must exactly have 2 columns
fr: `i` doit avoir exactement 2 colonnes

source: A default value is defined for the diagonal
fr: Une valeur par défaut est définie pour la diagonale

source: Specified indices are incorrect
fr: Les indices indiqués sont incorrects

source: The size of `value` doesn't correspond to the number of indexes
fr: La longueur de `value` ne correspond pas au nombre d'indices

source: All character vectors must contain value
fr: Tous les vecteurs doivent contenir au moins une valeur

source: At least the graph or the contiguity matrix must be provided
fr: Au moins le graphe ou la matrice de contiguïté doivent être fournis
